* Iteration 1 - Player
** DONE Creating Development Process doc 
   CLOCK: [2009-12-24 Thu 02:18]--[2009-12-24 Thu 02:23] =>  0:05
** DONE Working on Playing Game Package Diagram
   :CLOCK:
   CLOCK: [2009-12-25 Fri 12:45]--[2009-12-25 Fri 14:31] =>  1:46
   CLOCK: [2009-12-24 Thu 02:25]--[2009-12-24 Thu 02:45] =>  0:20
   :END:

** DONE Working on adding game bullets
   :CLOCK:
   CLOCK: [2010-01-02 Sat 22:14]--[2010-01-02 Sat 22:31] =>  0:17
   CLOCK: [2010-01-02 Sat 19:22]--[2010-01-02 Sat 20:13] =>  0:51
   :END:

** DONE Making the game horizontal rather than vertical
   CLOCK:    [2010-01-02 Sat 22:33]--[2010-01-02 Sat 22:51] =>  0:18
** DONE creating WarpEnergy class
   CLOCK: [2010-01-02 Sat 23:11]--[2010-01-02 Sat 23:23] =>  0:12

** DONE creating the warp circle
   CLOCK: [2010-01-03 Sun 23:25]--[2010-01-04 Mon 01:19] =>  1:54
** DONE is out of warp energy
   CLOCK: [2010-01-04 Mon 01:53]--[2010-01-04 Mon 01:58] =>  0:05

** DONE making a state where the player is completely warped out so they can warp anywhere on the screen
   CLOCK: [2010-01-07 Thu 01:31]--[2010-01-07 Thu 02:07] =>  0:36
** DONE if player enters shoot space, warp player out
   :CLOCK:
   CLOCK: [2010-01-09 Sat 19:47]--[2010-01-09 Sat 20:03] =>  0:16
   CLOCK: [2010-01-09 Sat 19:33]--[2010-01-09 Sat 19:43] =>  0:10
   :END:
** DONE do not allow warp in to shoot space
   CLOCK: [2010-01-09 Sat 19:43]--[2010-01-09 Sat 19:47] =>  0:04
** DONE create a sprite for the warp out, then scale the sprite in proportion to the energy
   :CLOCK:
   CLOCK: [2010-01-09 Sat 01:20]--[2010-01-09 Sat 02:09] =>  0:49
   CLOCK: [2010-01-08 Fri 23:45]--[2010-01-09 Sat 01:04] =>  1:19
   :END:
*** need to fix player grab on initial warp in
    CLOCK: [2010-01-09 Sat 17:54]--[2010-01-09 Sat 18:08] =>  0:14
** DONE create a meter to display the energy, maybe just a line for now
   CLOCK: [2010-01-07 Thu 02:20]--[2010-01-07 Thu 02:48] =>  0:28
** DONE go back and documentation - make sure to document all functions that return retained object
   :CLOCK:
   CLOCK: [2010-01-20 Wed 03:08]--[2010-01-20 Wed 03:11] =>  0:03
   CLOCK: [2010-01-10 Sun 18:21]--[2010-01-10 Sun 19:21] =>  1:00
   :END:
** DONE go back and check memory management
   :CLOCK:
   CLOCK: [2010-01-13 Wed 01:16]--[2010-01-13 Wed 02:39] =>  1:23
   CLOCK: [2010-01-10 Sun 20:53]--[2010-01-10 Sun 21:01] =>  0:08
   :END:
** DONE make the warp circle touch area more cirle like
   CLOCK: [2010-01-11 Mon 00:50]--[2010-01-11 Mon 01:17] =>  0:27

** DONE create player dying and game over
   CLOCK: [2010-01-13 Wed 02:40]--[2010-01-13 Wed 03:15] =>  0:35
** DONE making fire rate
   CLOCK: [2010-01-20 Wed 02:07]--[2010-01-20 Wed 02:39] =>  0:32
** TODO create a scrolling background 
   CLOCK: [2010-01-09 Sat 01:08]--[2010-01-09 Sat 01:20] =>  0:12
** TODO go back and create tests
   :CLOCK:
   CLOCK: [2010-01-20 Wed 03:05]--[2010-01-20 Wed 03:07] =>  0:02
   CLOCK: [2010-01-18 Mon 20:04]--[2010-01-18 Mon 21:04] =>  1:00
   CLOCK: [2010-01-10 Sun 23:44]--[2010-01-10 Sun 23:54] =>  0:10
   :END:
*** TODO fix code to become more testable
    CLOCK: [2010-01-24 Sun 22:54]--[2010-01-24 Sun 23:34] =>  0:40
** TODO i think there needs to be a penalty for warping out

* Iteration 2 - Enemy
** DONE Define format for loading levels
   CLOCK: [2010-02-08 Mon 21:18]--[2010-02-08 Mon 23:18] =>  2:00
** TODO Create class to load levels
   :CLOCK:
   CLOCK: [2010-02-08 Mon 23:18]--[2010-02-09 Tue 00:42] =>  1:24
   :END:
** TODO Create enemy format
** TODO Create factory for creating enemies
** TODO Create Paths
   CLOCK: [2010-02-11 Thu 23:43]--[2010-02-12 Fri 01:00] =>  1:17
** TODO Create Action
   :CLOCK:
   CLOCK: [2010-02-13 Sat 18:16]--[2010-02-13 Sat 19:01] =>  0:45
   CLOCK: [2010-02-12 Fri 01:01]--[2010-02-12 Fri 01:12] =>  0:11
   :END:
** TODO Create Patterns
   :CLOCK:
   CLOCK: [2010-02-13 Sat 21:45]--[2010-02-13 Sat 21:53] =>  0:08
   CLOCK: [2010-02-13 Sat 20:20]--[2010-02-13 Sat 21:04] =>  0:44
   :END:
** TODO Create basic enemy.
   CLOCK: [2010-02-13 Sat 16:51]--[2010-02-13 Sat 18:16] =>  1:25
** TODO Load basic enemy and have them move around screen
   CLOCK: [2010-02-14 Sun 16:12]--[2010-02-14 Sun 18:11] =>  1:59
** TODO Make GameLayer a singleton
   CLOCK: [2010-02-13 Sat 19:01]--[2010-02-13 Sat 20:20] =>  1:19
** DONE Create mysql backend for storing level elements
   :CLOCK:
   CLOCK: [2010-02-14 Sun 15:47]--[2010-02-14 Sun 16:10] =>  0:23
   CLOCK: [2010-02-14 Sun 14:18]--[2010-02-14 Sun 14:50] =>  0:32
   CLOCK: [2010-02-14 Sun 11:26]--[2010-02-14 Sun 12:40] =>  1:14
   CLOCK: [2010-02-13 Sat 22:27]--[2010-02-14 Sun 02:16] =>  3:49
   :END:
** TODO check memory management
** TODO make enemy collide with player bullet
** TODO make enemy collide with player
   :CLOCK:
   CLOCK: [2010-02-14 Sun 19:34]--[2010-02-14 Sun 20:13] =>  0:39
   CLOCK: [2010-02-14 Sun 18:18]--[2010-02-14 Sun 18:38] =>  0:20
   :END:
** TODO make enemy disappear when off screen
** TODO figure out way to refresh database
** TODO add caching proxy
** TODO need to upgrade cocos2d
   CLOCK: [2010-02-15 Mon 00:53]
** TODO need to make maingameloop and player interfaces more intuitive
   CLOCK: [2010-02-14 Sun 22:02]--[2010-02-15 Mon 00:53] =>  2:51
** TODO make sure all is documented
* add key so no longer need to type password to checkin
